index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-21 Fri 14:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Package</title>
<meta name="generator" content="Org mode" />
<meta charset="UTF-8">
<link rel="stylesheet" type="text/css" href="index.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Package</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd3bac4e">1. A naive theme for my so-call publish essays</a>
<ul>
<li><a href="#orgd9c1639">1.1. Problem: Want to write and publish my essays in Emacs</a>
<ul>
<li><a href="#orge253fe9">1.1.1. But I feel frustration when look at other already open-source solution.</a></li>
<li><a href="#org3ccdcfa">1.1.2. So I built my own solution. Hope that it will work out-of-the-box</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd3bac4e" class="outline-2">
<h2 id="orgd3bac4e"><span class="section-number-2">1</span> A naive theme for my so-call publish essays</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd9c1639" class="outline-3">
<h3 id="orgd9c1639"><span class="section-number-3">1.1</span> Problem: Want to write and publish my essays in Emacs</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge253fe9" class="outline-4">
<h4 id="orge253fe9"><span class="section-number-4">1.1.1</span> But I feel frustration when look at other already open-source solution.</h4>
</div>

<div id="outline-container-org3ccdcfa" class="outline-4">
<h4 id="org3ccdcfa"><span class="section-number-4">1.1.2</span> So I built my own solution. Hope that it will work out-of-the-box</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
The design and idea base on Edward Tufte design.
</p>
<div class="sidenote">
<p>
You can read about this design at <a href="https://edwardtufte.github.io/tufte-css/">this page</a>
</p>

</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-21 Fri 14:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
